[{"summary":"With the current craze about micro-services I spend a considerable amount of time dealing with Rest API's. They mostly send and receive data in JSON format. That is where Jackson comes in handy. In this article I'll show some code examples of some non trivial use cases of Jackson I came across.\n","title":"Effective Jackson with annotations in Spring Boot","slug":"effective-jackson-with-annotations-in-spring-boot","updatedOn":"2019-02-14T20:47:54.000Z"},{"summary":"Git rebase is like fire. In inexperienced hands in can do a lot of harm, but if its handled with care it will make your life much better. Let it help you make your projects easier to maintain.  ","title":"Git rebase is like fire","slug":"git-rebase-is-like-fire","updatedOn":"2019-02-14T20:47:14.000Z"},{"summary":"As a young and passionate software developer I have a tendency to try to solve EVERY problem through writing a piece of code. When I decided to start a blog writing my own solution was only natural. \n","title":"How not to start a blog","slug":"how-not-to-start-a-blog","updatedOn":"2019-02-14T20:48:28.000Z"},{"summary":"Redux allows to share state between component and also it helps to separate state from the component which aids testing. Unfortunately it also adds unnecessary layers of complexity. In order to have asynchronous behaviour in Redux  you'll need to write a lot of code. In a world where everything is asynchronous I've had enough of confusing middle-wares, numerous action creators and obscure yield operators. In this article I will demonstrate how simple async operations can become without Redux.","title":"Make async simple again! - aka state store in 52 lines","slug":"make-async-simple-again-aka-state-store-in-52-lines","updatedOn":"2019-02-14T20:40:53.000Z"},{"summary":"There is a common misconception within the Java community that having private variables in JS is impossible. This isn't true. It simply requires a little more work than writing private in front of the variable name. \n","title":"Private variables in JavaScript aka What are Closures!?","slug":"private-variables-in-javascript-aka-what-are-closures","updatedOn":"2019-02-14T20:46:38.000Z"},{"summary":"Since I was a kid I loved playing with building blocks and I found that programming is just like playing with building blocks.\n","title":"Since I was a kid I loved playing with building blocks","slug":"since-i-was-a-kid-i-loved-playing-with-building-blocks","updatedOn":"2019-02-14T20:48:55.000Z"}]
